app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:id])